Revit 2026 API

# StructuralSectionGeneralHInnerFillet Property

---

Inner Fillet - Corner fillet inner radius.

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double InnerFillet { get; set; }
```
```vb
Public Property InnerFillet As Double
	Get
	Set
```
```cpp
public:
property double InnerFillet {
	double get ();
	void set (double value);
}
```
```fsharp
member InnerFillet : float with get, set
```

#### Property Value

Double

#### Reference

StructuralSectionGeneralH Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace